package day08;

public class ArrayEx04_HW {
	
	// 주말 동안 숙제 ==> 정렬 알고리즘 (버블정렬, 선택정렬, 삽입정렬에 대하여 공부해오기)
			// (정렬 방법과 소스를 작성해 보기)

			/*
			 * 1. 버블 정렬(Bubble Sort) : 데이터의 인접 요소끼리 비교하고, swap 연산을 수행하며 정렬하는 방식 
			 * 2. 선택정렬(Selection Sort) : 대상에서 가장 크거나 작은 데이터를 찾아가 선택을 반복하면서 정렬하는 방식 
			 * 3. 삽입정렬(Insertion Sort) : 대상을 선택해 정렬된 영역에서 선택 데이터의 적절한 위치를 찾아 삽입하면서 정렬하는 방식 
			 * 4. 퀵 정렬(Quick Sort) : pivot 값을 선정해 해당 값을 기준으로 정렬하는 방식 
			 * 5. 병합 정렬(Merge Sort) : 이미 정렬된 부분 집합들을 효율적으로 병합해 전체를 정렬하는 방식 
			 * 6. 기수 정렬(Radix Sort) : 데이터의 자릿수를 바탕으로 비교해 데이터를 정렬하는 방식
			 */
	

}
