package day08;

public class ArrayEx04 {

	public static void main(String[] args) {
		/*
		 	문제) 년도를 입력 받아 해당 년도의 간지를 출력하시오.
		 	(단, 서기 1년은 '신유'년이다. )
		 	10간 : 갑,을,병,정,무,기,경,신,임,계
		 	12지 : 자,축,인,묘,진,사,오,미,신,유,술,해
		 
		 */
		
		/*
		   문제) 컴퓨터와 가위,바위,보 게임을 진행하는 프로그램을 작성하시오.
		   		컴퓨터의 가위,바위,보는 난수를 이용해서 정하고 
		   		사용자의 가위,바위,보는 입력을 받아서 정한다.
		   		( 컴퓨터의 가위 바위 보를 정할 때 배열을 사용한다. )
		 */
		
		// 주말 동안 숙제 ==> 정렬 알고리즘 (버블정렬, 선택정렬, 삽입정렬에 대하여 공부해오기)
		// (정렬 방법과 소스를 작성해 보기)
	}

}
